NordicSemiconductor/nrfx/mdk/nrf54l20_enga_application.svd
        <register>
          <name>TRCVICTLR</name>
          <description>Controls instruction trace filtering. Might ignore writes when the trace unit is enabled or not idle. Only returns stable data when TRCSTATR.PMSTABLE == 1. Must be programmed, particularly to set the value of the SSSTATUS bit, which sets the state of the start/stop logic.</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENT_SEL</name>
              <description>Select which resource number should be filtered.</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>This event is not filtered.</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>This event is filtered.</description>
                  <value>0x01</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSSTATUS</name>
              <description>When TRCIDR4.NUMACPAIRS &amp;gt; 0 or TRCIDR4.NUMPC &amp;gt; 0, this bit returns the status of the start/stop logic.</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Stopped</name>
                  <description>The start/stop logic is in the stopped state.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Started</name>
                  <description>The start/stop logic is in the started state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRCRESET</name>
              <description>Controls whether a trace unit must trace a Reset exception.</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The trace unit does not trace a Reset exception unless it traces the exception or instruction immediately prior to the Reset exception.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The trace unit always traces a Reset exception.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRCERR</name>
              <description>When TRCIDR3.TRCERR==1, this bit controls whether a trace unit must trace a System error exception.</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The trace unit does not trace a System error exception unless it traces the exception or instruction immediately prior to the System error exception.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The trace unit always traces a System error exception, regardless of the value of ViewInst.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXLEVEL0_S</name>
              <description>In Secure state, each bit controls whether instruction tracing is enabled for the corresponding Exception level 0.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The trace unit does not generate instruction trace, in Secure state, for Exception level 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The trace unit generates instruction trace, in Secure state, for Exception level 0.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXLEVEL1_S</name>
              <description>In Secure state, each bit controls whether instruction tracing is enabled for the corresponding Exception level 1.</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The trace unit does not generate instruction trace, in Secure state, for Exception level 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The trace unit generates instruction trace, in Secure state, for Exception level 1.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXLEVEL2_S</name>
              <description>In Secure state, each bit controls whether instruction tracing is enabled for the corresponding Exception level 2.</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The trace unit does not generate instruction trace, in Secure state, for Exception level 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The trace unit generates instruction trace, in Secure state, for Exception level 2.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXLEVEL3_S</name>
              <description>In Secure state, each bit controls whether instruction tracing is enabled for the corresponding Exception level 3.</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The trace unit does not generate instruction trace, in Secure state, for Exception level 3.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The trace unit generates instruction trace, in Secure state, for Exception level 3.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXLEVEL0_NS</name>
              <description>In Non-secure state, each bit controls whether instruction tracing is enabled for the corresponding Exception level 0.</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The trace unit does not generate instruction trace, in Non-secure state, for Exception level 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The trace unit generates instruction trace, in Non-secure state, for Exception level 0.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXLEVEL1_NS</name>
              <description>In Non-secure state, each bit controls whether instruction tracing is enabled for the corresponding Exception level 1.</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The trace unit does not generate instruction trace, in Non-secure state, for Exception level 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The trace unit generates instruction trace, in Non-secure state, for Exception level 1.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXLEVEL2_NS</name>
              <description>In Non-secure state, each bit controls whether instruction tracing is enabled for the corresponding Exception level 2.</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The trace unit does not generate instruction trace, in Non-secure state, for Exception level 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The trace unit generates instruction trace, in Non-secure state, for Exception level 2.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXLEVEL3_NS</name>
              <description>In Non-secure state, each bit controls whether instruction tracing is enabled for the corresponding Exception level 3.</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The trace unit does not generate instruction trace, in Non-secure state, for Exception level 3.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The trace unit generates instruction trace, in Non-secure state, for Exception level 3.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
