NordicSemiconductor/nrfx/mdk/nrf54l20_enga_application.svd
    <peripheral derivedFrom="GLOBAL_SPIS00_NS">
      <name>GLOBAL_SPIS24_NS</name>
      <description>SPI Slave 10</description>
      <baseAddress>0x400EE000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM24_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL24</name>
        <value>238</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM20_NS">
      <name>GLOBAL_TWIM24_NS</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 8</description>
      <baseAddress>0x400EE000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM24_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL24</name>
        <value>238</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS20_NS">
      <name>GLOBAL_TWIS24_NS</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 8</description>
      <baseAddress>0x400EE000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM24_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL24</name>
        <value>238</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE00_NS">
      <name>GLOBAL_UARTE24_NS</name>
      <description>UART with EasyDMA 10</description>
      <baseAddress>0x400EE000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM24_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL24</name>
        <value>238</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM00_NS">
      <name>GLOBAL_SPIM24_S</name>
      <description>Serial Peripheral Interface Master with EasyDMA 11</description>
      <baseAddress>0x500EE000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL24</name>
        <value>238</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS00_NS">
      <name>GLOBAL_SPIS24_S</name>
      <description>SPI Slave 11</description>
      <baseAddress>0x500EE000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM24_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL24</name>
        <value>238</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM20_NS">
      <name>GLOBAL_TWIM24_S</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 9</description>
      <baseAddress>0x500EE000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM24_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL24</name>
        <value>238</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS20_NS">
      <name>GLOBAL_TWIS24_S</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 9</description>
      <baseAddress>0x500EE000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM24_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL24</name>
        <value>238</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE00_NS">
      <name>GLOBAL_UARTE24_S</name>
      <description>UART with EasyDMA 11</description>
      <baseAddress>0x500EE000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM24_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL24</name>
        <value>238</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPU00_S">
      <name>GLOBAL_SPU30_S</name>
      <description>System protection unit 3</description>
      <baseAddress>0x50100000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <interrupt>
        <name>SPU30</name>
        <value>256</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_DPPIC00_NS">
      <name>GLOBAL_DPPIC30_NS</name>
      <description>Distributed programmable peripheral interconnect controller 8</description>
      <baseAddress>0x40102000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_DPPIC00_NS">
      <name>GLOBAL_DPPIC30_S</name>
      <description>Distributed programmable peripheral interconnect controller 9</description>
      <baseAddress>0x50102000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_PPIB00_NS">
      <name>GLOBAL_PPIB30_NS</name>
      <description>PPIB APB registers 22</description>
      <baseAddress>0x40103000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_PPIB00_NS">
      <name>GLOBAL_PPIB30_S</name>
      <description>PPIB APB registers 23</description>
      <baseAddress>0x50103000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM00_NS">
      <name>GLOBAL_SPIM30_NS</name>
      <description>Serial Peripheral Interface Master with EasyDMA 12</description>
      <baseAddress>0x40104000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL30</name>
        <value>260</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS00_NS">
      <name>GLOBAL_SPIS30_NS</name>
      <description>SPI Slave 12</description>
      <baseAddress>0x40104000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM30_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL30</name>
        <value>260</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM20_NS">
      <name>GLOBAL_TWIM30_NS</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 10</description>
      <baseAddress>0x40104000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM30_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL30</name>
        <value>260</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS20_NS">
      <name>GLOBAL_TWIS30_NS</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 10</description>
      <baseAddress>0x40104000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM30_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL30</name>
        <value>260</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE00_NS">
      <name>GLOBAL_UARTE30_NS</name>
      <description>UART with EasyDMA 12</description>
      <baseAddress>0x40104000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM30_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL30</name>
        <value>260</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM00_NS">
      <name>GLOBAL_SPIM30_S</name>
      <description>Serial Peripheral Interface Master with EasyDMA 13</description>
      <baseAddress>0x50104000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL30</name>
        <value>260</value>
      </interrupt>
    </peripheral>
